app/controllers/altitude_types_controller.rb

SELECT * FROM `altitude_types`
---
  def index
    @altitude_types = AltitudeType.all

SELECT * FROM `sampling_sites` WHERE (altitude_types_id = '4') LIMIT 1
---
  def destroy
    if !signed_in_and_master?
      flash[:notice] = "Sorry. Only technical manager can delete data. Please, contact Roberto SPURIO to do it."
      redirect_to altitude_types_path
    else

        @ss = SamplingSite.find(:first, :conditions => [ "altitude_types_id = ?", params[:id]])