app/controllers/catchment_areas_controller.rb

SELECT * FROM `catchment_areas`
---
  def index
    @catchment_areas = CatchmentArea.all

SELECT * FROM `sampling_sites` WHERE (catchment_areas_id = '4') LIMIT 1
SELECT * FROM `catchment_areas` WHERE (`catchment_areas`.`id` = 3)
DELETE FROM `catchment_areas` WHERE `id` = 3
---
  def destroy
    if !signed_in_and_master?
      flash[:notice] = "Sorry. Only technical manager can delete data. Please, contact Roberto SPURIO to do it."
      redirect_to catchment_areas_path
    else

        @ss = SamplingSite.find(:first, :conditions => [ "catchment_areas_id = ?", params[:id]])
        if !@ss.nil?
          flash[:error] = "This entry cannot be deleted until used by another entries in the system..."
          redirect_to :action => "index"
          return
        end

        @catchment_area = CatchmentArea.find(params[:id])
        @catchment_area.destroy