app/controllers/code_types_controller.rb

SELECT * FROM `code_types`
---
  def index
    @code_types = CodeType.all