app/controllers/depths_controller.rb

SELECT * FROM `depths`
---
  def index
    @depths = Depth.all

SELECT * FROM `sampling_sites` WHERE (depth_id = '3') LIMIT 1
---
  def destroy
    if !signed_in_and_master?
      flash[:notice] = "Sorry. Only technical manager can delete data. Please, contact Roberto SPURIO to do it."
      redirect_to depths_path
    else

        @ss = SamplingSite.find(:first, :conditions => [ "depth_id = ?", params[:id]])