app/controllers/filter_samples_controller.rb

        #@filter_samples = FilterSample.all
        #@cond = "sampling_id"
        #filter_samples = FilterSample.find(:all, :joins => [:sampling, :wfilter, :sampling_site]) do
        filter_samples = FilterSample.find(:all, :joins => [:sampling, :wfilter]) do
---
SELECT * FROM `samplings` WHERE (`samplings`.`id` = 1)
SELECT * FROM `wfilters` WHERE (`wfilters`.`id` = 2)

  def show
    @filter_sample = FilterSample.find(params[:id])
    if @filter_sample.nil?
        redirect_to :action => "index"
    end
    @title = "Filter samples"
    @s = Sampling.find(@filter_sample.sampling_id)
---
SELECT * FROM `filter_samples` WHERE (`filter_samples`.`id` = 1)
SELECT * FROM `samplings` WHERE (`samplings`.`id` = 1)

  def new
    @filter_sample = FilterSample.new
    @title = "Filter sample"

    @s_c = Sampling.count()
    if @s_c.nil? or @s_c == 0
      flash[:error] = "No sampling found! create first someone..."
      redirect_to :action => "index"
      return
    end

    @pt = Partner.find(:first, :conditions => [ "user_id = ?", current_user.id])
    if @pt.nil?
      @s = Sampling.all()
    else
      @s = Sampling.all(:conditions => [ "partner_id = ?", @pt.id])
    end
    @sx = @s.first
    if !@sx.nil?
        @codegen = get_code(@sx.id)
    else
      flash[:error] = "No sampling created by you found! create your own first sampling before inserting filter sample..."
      redirect_to :action => "index"
      return
    end
    @wf = Wfilter.all()
---
SELECT count(*) AS count_all FROM `samplings`
SELECT * FROM `partners` WHERE (user_id = 3) LIMIT 1
SELECT * FROM `samplings` WHERE (partner_id = 3)
SELECT * FROM `samplings` WHERE (`samplings`.`id` = 1)
SELECT * FROM `wfilters`

  def edit
    #@filter_sample = FilterSample.find(params[:id])  --> Yet done in def correct_user
    @title = "Filter sample"
    @code = @filter_sample.code
    @sampling = Sampling.find(@filter_sample.sampling_id)
    #Cannot change the sample set during creation
    #<%= select :filter_sample,:sampling_id,Sampling.find(:all).collect{|p| [p.verbose_me, p.id]}%>
    @wfilter = Wfilter.find(@filter_sample.wfilter_id)
---
SELECT * FROM `samplings` WHERE (`samplings`.`id` = 2)
SELECT * FROM `wfilters` WHERE (`wfilters`.`id` = 1)

  def create
    @filter_sample = FilterSample.new(params[:filter_sample])
    @title = "Filter sample"

    @filter_sample.code = get_code(@filter_sample.sampling_id)

    #deprecated field self.pore_size
#    @wf = Wfilter.find(@filter_sample.wfilter_id)
#    if !@wf.nil?
#        @filter_sample.pore_size = @wf.pore_size
#    else
#        @filter_sample.pore_size = 0
#    end

    respond_to do |format|
      if @filter_sample.save
        format.html { redirect_to(@filter_sample, :notice => 'FilterSample was successfully created.') }
        format.xml  { render :xml => @filter_sample, :status => :created, :location => @filter_sample }
      else
        @s_c = Sampling.count()
        @pt = Partner.find(:first, :conditions => [ "user_id = ?", current_user.id])
        if @pt.nil?
          @s = Sampling.all()
        else
          @s = Sampling.all(:conditions => [ "partner_id = ?", @pt.id])
        end
        @wf = Wfilter.all()
---
INSERT INTO `filter_samples` (`samplingDate`, `pore_size`, `created_at`, `wfilter_id`, `code`, `updated_at`, `barcode`, `num_filters`, `avg_qta`, `volume`, `note`, `sampling_id`) VALUES('2011-11-22 00:00:00', 5.0, '2011-11-22 23:12:44', 4, 'P03-110705-003F01', '2011-11-22 23:12:44', '111111111111111111', 1, 0.0, 22.0, '', 3)
SELECT count(*) AS count_all FROM `samplings`
SELECT * FROM `partners` WHERE (user_id = 3) LIMIT 1
SELECT * FROM `samplings` WHERE (partner_id = 3)
SELECT * FROM `samplings` WHERE (`samplings`.`id` = 1)
SELECT * FROM `wfilters`