app/controllers/geologies_controller.rb

  def index
    @geologies = Geology.all
---
SELECT * FROM `geologies`

  def destroy
    if !signed_in_and_master?
      flash[:notice] = "Sorry. Only technical manager can delete data. Please, contact Roberto SPURIO to do it."
      redirect_to geologies_path
    else

        @ss = SamplingSite.find(:first, :conditions => [ "geologies_id = ?", params[:id]])
        if !@ss.nil?
          flash[:error] = "This entry cannot be deleted until used by another entries in the system..."
          redirect_to :action => "index"
          return
        end

        @geology = Geology.find(params[:id])
        @geology.destroy
---
SELECT * FROM `sampling_sites` WHERE (geologies_id = '3') LIMIT 1
SELECT * FROM `geologies` WHERE (`geologies`.`id` = 3)
DELETE FROM `geologies` WHERE `id` = 3