app/controllers/geos_controller.rb

SELECT * FROM `geos`
---
  def index
    @geos = Geo.all

SELECT * FROM `geos` WHERE (`geos`.`id` = 1)
---
  def show
    @geo = Geo.find(params[:id])

SELECT * FROM `geos` WHERE (`geos`.`id` = 1)
---
  def edit
    @geo = Geo.find(params[:id])

SELECT * FROM `sampling_sites` WHERE (geos_id = '3') LIMIT 1
---
  def destroy
    if !signed_in_and_master?
      flash[:notice] = "Sorry. Only technical manager can delete data. Please, contact Roberto SPURIO to do it."
      redirect_to geos_path
    else

        @title = "Geographical position"

        @ss = SamplingSite.find(:first, :conditions => [ "geos_id = ?", params[:id]])