app/controllers/land_use_mappings_controller.rb

  def index
    @land_use_mappings = LandUseMapping.all
---
SELECT * FROM `land_use_mappings`

  def show
    @land_use_mapping = LandUseMapping.find(params[:id])
---
SELECT * FROM `land_use_mappings` WHERE (`land_use_mappings`.`id` = 1)

  def edit
    @land_use_mapping = LandUseMapping.find(params[:id])
---
SELECT * FROM `land_use_mappings` WHERE (`land_use_mappings`.`id` = 1)

  def destroy

    @title = "land use mapping"

    @ss = SamplingSite.find(:first, :conditions => [ "land_use_mappings_id = ?", params[:id]])
    if !@ss.nil?
      flash[:error] = "This entry cannot be deleted until used by another entries in the system..."
      redirect_to :action => "index"
      return
    end

    @land_use_mapping = LandUseMapping.find(params[:id])
    @land_use_mapping.destroy
---
SELECT * FROM `sampling_sites` WHERE (land_use_mappings_id = '3') LIMIT 1
SELECT * FROM `land_use_mappings` WHERE (`land_use_mappings`.`id` = 3)
DELETE FROM `land_use_mappings` WHERE `id` = 3