app/controllers/micro_arrays_controller.rb

  def index
    @micro_arrays = MicroArray.all
---
SELECT * FROM `micro_arrays`