app/controllers/micro_array_images_controller.rb

  def index
    @micro_array_images = MicroArrayImage.all
---
SELECT * FROM `micro_array_images`