app/controllers/micro_array_datas_controller.rb

SELECT * FROM `micro_array_datas`
---
  def index
    @micro_array_datas = MicroArrayData.all