app/controllers/micro_array_validations_controller.rb

SELECT * FROM `micro_array_validations`
---
  def index
    @micro_array_validations = MicroArrayValidation.all