app/controllers/micro_array_analysis_files_controller.rb

SELECT * FROM `micro_array_analysis_files`
---
  def index
    @micro_array_analysis_files = MicroArrayAnalysisFile.all