app/controllers/oligo_sequences_controller.rb

  def new
    @oligo_sequence = OligoSequence.new
    @title = "Oligo sequence"

    #<%= collection_select(:oligo_sequence, :partner_id, @partners, :id, :verbose_me, options ={}, :class =>"partner") %>

    @partners = Partner.find(:all)
---
SELECT * FROM `partners` WHERE (user_id = 1) LIMIT 1