app/controllers/oligo_sequences_controller.rb

  def index
    @oligo_sequences = OligoSequence.all
    @title = "List of oligo sequences"

    #oligo_sequences = OligoSequence.find(:all, :joins => [:people, :partner]) do
#KAPPAO: Association named 'people' was not found; perhaps you misspelled it?
    #oligo_sequences = OligoSequence.find(:all, :joins => [:person, :partner]) do
#Mysql::Error: Unknown column 'oligo_sequences.person_id' in 'on clause': SELECT `oligo_sequences`.* FROM `oligo_sequences`   INNER JOIN `people` ON `people`.id = `oligo_sequences`.person_id  INNER JOIN `partners` ON `partners`.id = `oligo_sequences`.partner_id   LIMIT 0, 20
#KAPPAO: migrate person generate people table but the rails do not re-construct right renaming
    _str = ""
    oligo_sequences = OligoSequence.find(:all, :joins => [:partner]) do
---
SELECT * FROM `oligo_sequences`
SELECT * FROM `partners` WHERE (`partners`.`id` = 1)

  def show
    @oligo_sequence = OligoSequence.find(params[:id])
---
SELECT * FROM `oligo_sequences` WHERE (`oligo_sequences`.`id` = 1)

  def edit
    @oligo_sequence = OligoSequence.find(params[:id])
    @title = "oligo sequence"

    @pt = Partner.find(@oligo_sequence.partner_id)
---
SELECT * FROM `oligo_sequences` WHERE (`oligo_sequences`.`id` = 1)
SELECT * FROM `partners` WHERE (`partners`.`id` = 1)

  def create

  logger.debug "::::::::::::::::::::Oligo Sequence create action (" + current_user.name + "):::::::::::::::::::: "

    @oligo_sequence = OligoSequence.new(params[:oligo_sequence])
    @title = "oligo sequence"

    @oligo_sequence.dna_sequence = @oligo_sequence.dna_sequence.upcase

    @asso = PartnerPerson.find(:first,
        :conditions => [ "person_id = ? AND partner_id = ?", @oligo_sequence.people_id, @oligo_sequence.partner_id])
    unless @asso.nil?
      #set the selected item
      @oligo_sequence.partner_people_id = @asso.id
    end

    respond_to do |format|
      if @oligo_sequence.save
---
SELECT * FROM `partners` WHERE (`partners`.`id` = 1)
SELECT `oligo_sequences`.id FROM `oligo_sequences` WHERE (LOWER(`oligo_sequences`.`DNA_Sequence`) = BINARY 'agatagacatagacgatagacagatag') LIMIT 1
INSERT INTO `oligo_sequences` (`name`, `created_at`, `DNA_Sequence`, `tax_id_id`, `updated_at`, `description`, `partner_id`) VALUES('GEN757', '2011-11-24 14:06:31', 'AGATAGACATAGACGATAGACAGATAG', 1, '2011-11-24 14:06:31', 'test primer for amplifying sample 95', 1)

  def update
    @oligo_sequence = OligoSequence.find(params[:id])
    @title = "oligo sequence"

    if !params[:oligo_sequence][:dna_sequence].nil?
        params[:oligo_sequence][:dna_sequence] = params[:oligo_sequence][:dna_sequence].upcase
    end
    respond_to do |format|
      if @oligo_sequence.update_attributes(params[:oligo_sequence])
        format.html { redirect_to(@oligo_sequence, :notice => 'OligoSequence was successfully updated.') }
        format.xml  { head :ok }
      else

        @pt = Partner.find(@oligo_sequence.partner_id)
---
SELECT * FROM `oligo_sequences` WHERE (`oligo_sequences`.`id` = 1)
UPDATE `oligo_sequences` SET `updated_at` = '2011-11-24 14:07:10', `DNA_Sequence` = 'AGATAGACATAGACGATAGAC' WHERE `id` = 1
SELECT * FROM `partners` WHERE (`partners`.`id` = 1)