app/controllers/samplings_controller.rb

  def index
    @samplings = Sampling.all
---
SELECT * FROM `samplings`

  def show
    @sampling = Sampling.find(params[:id])
    @title = "Sampling"

    if @sampling.nil?
        redirect_to :action => "index"
    end
    @pt = Partner.find(@sampling.partner_id)
    @ss = SamplingSite.find(@sampling.sampling_site_id)
    if @ss.nil?
      flash.now[:error] = "No sampling sites found! create some..."
      redirect_to :action => "index"
    end

    @fs = FilterSample.all(:conditions => ['sampling_id = ?', @sampling.id ])
---
SELECT * FROM `samplings` WHERE (`samplings`.`id` = 3)
SELECT * FROM `partners` WHERE (`partners`.`id` = 3)
SELECT * FROM `sampling_sites` WHERE (`sampling_sites`.`id` = 1)
SELECT * FROM `filter_samples` WHERE (sampling_id = 1)

  def new
    @sampling = Sampling.new
    @title = "Sampling"

    #Popolate dropdownlist
    #select(object, method, choices, options = {}, html_options = {})
    #    <%= select :sampling, :partner_id, Partner.find(:all).collect{|p| [p.fp7_Number.to_s + " " + p.name, p.id]}%>
    #collection_select(object, method, collection, value_method, text_method, options = {}, html_options = {})
    #Defined in ActionView::Helpers::FormOptionsHelper
    #<div class="field cod">
    #  <%= f.label :selected_type, "Code type" %><br />
    #  <%= select (:selected_type, :code, @codtypes.map {|u| [u.verbose_me,u.code]}) %>
    #</div>

    @partners = Partner.find(:all)
    @pt = Partner.find(:first, :conditions => [ "user_id = ?", current_user.id])
    unless @pt.nil?
      #set the selected item
      @sampling.partner_id = @pt.id
    end

    #@codtypes = CodeType.all()
    @codegen = get_code(@pt, nil, nil)

    #used for NESTED Model
    #pre-build another attribute while loading the form
    @wf = Wfilter.all()
    @wf.count().times { @sampling.filter_samples.build }
---
SELECT * FROM `partners` WHERE (user_id = 3) LIMIT 1
SELECT * FROM `wfilters`
SELECT * FROM `partners`
SELECT count(*) AS count_all FROM `samplings` WHERE (partner_id = 3 AND samplingDate >= '2011-11-23' AND samplingDate < '2011-11-25' )

#    end
    @attr_index = 1

    @ss_c = SamplingSite.count()
---
SELECT count(*) AS count_all FROM `sampling_sites`

  def edit
    #@sampling = Sampling.find(params[:id])  --> Yet done in def correct_user
    @title = "Sampling"
    @code = @sampling.code
    #Cannot change the sample site set during creation
    #<%= select :sampling,:sampling_site_id,SamplingSite.find(:all).collect{|p| [p.code + " " + p.name, p.id]}%>
    #@ss = SamplingSite.find(params[:id])  --> Yet done in def correct_user
    #Cannot change the partner
    #<%= select :sampling, :partner_id,Partner.find(:all).collect{|p| [p.name, p.id]}%>

    #used for NESTED Model
    @wf = Wfilter.all()
    @fs = FilterSample.all(:conditions => ['sampling_id = ' +@sampling.id.to_s ])
---
SELECT * FROM `wfilters`
SELECT * FROM `filter_samples` WHERE (`filter_samples`.sampling_id = 27)

  def create
    @sampling = Sampling.new(params[:sampling])

    #used for NESTED Model
    @wf = Wfilter.all()

    @valid = false
    if @sampling.sampling_site.nil?
      flash.now[:error] = "No sampling site set for this sampling"
      @valid = true
    end
    if @sampling.partner.nil?
      flash.now[:error] = "No partner found for this sampling"
      @valid = true
    end

    if @valid
      respond_to do |format|
        format.html { render :action => "new" }
        format.xml  { render :xml => @sampling.errors, :status => :unprocessable_entity }
      end
    end

    @pt = Partner.find(:first, :conditions => [ "user_id = ?", current_user.id])
---
SELECT * FROM `wfilters`
SELECT * FROM `partners` WHERE (user_id = 3) LIMIT 1

        #create new filter object
        #@obj_new_filter = Wfilter.new(:name => @new_filter)
        #@obj_new_filter = Wfilter.create(:name => @new_filter)
        @obj_new_filter = Wfilter.create(:name => @sampling.code)
---
INSERT INTO `samplings` (`air_temperature`, `moisture`, `windSpeed`, `lightIntensity`, `samplingDate`, `phosphates`, `created_at`, `code`, `ph`, `cod`, `windDirection`, `depth`, `water_temperature`, `h2osat`, `updated_at`, `turbidity`, `salinity`, `nitrates`, `pressure`, `tidalRange`, `volume`, `operators`, `nitrogen`, `sampling_site_id`, `note`, `conductivity`, `bod5`, `partner_id`, `waterFlow`, `rainfallEvents`) VALUES(1.0, 3.0, 4.0, 7.0, '2011-11-22 00:00:00', 13.0, '2011-11-22 14:09:09', 'P03-111122-016', 12.0, 18.0, '5', 9.0, 2.0, 19.0, '2011-11-22 14:09:09', 10.0, 0.0, 14.0, 0.0, 11.0, 12.0, 'asdasdadsdas', 16.0, 1, 'some notes', 12.0, 17.0, 3, 6.0, 8.0)

      if @sampling.save

        #Change the child code attribute here because the parent code is yet created
        @fs = FilterSample.count(:all, :conditions => ['sampling_id = ' +@sampling.id.to_s ])
---
SELECT * FROM `filter_samples` WHERE (sampling_id = 14)
SELECT count(*) AS count_all FROM `filter_samples` WHERE (sampling_id = 42)

  def update
    #@sampling = Sampling.find(params[:id])  --> Yet done in def correct_user
    @title = "Sampling"
    #@is_Auth = is_current_user(@sampling.partner_id)  --> Yet done in def correct_user

    #used for NESTED Model
    @wf = Wfilter.all()

    respond_to do |format|
      if @sampling.update_attributes(params[:sampling])
---
SELECT * FROM `wfilters`
UPDATE `samplings` SET `updated_at` = '2011-11-22 17:50:33', `operators` = '' WHERE `id` = 2