app/controllers/sampling_sites_controller.rb

SELECT * FROM `sampling_sites`
---
  def index
    @sampling_sites = SamplingSite.all

SELECT * FROM `geos` WHERE (`geos`.`id` = 1)
---

    for ss in @sampling_sites
        g = ss.geo
        g = Geo.find(ss.geos_id) #undefined method `lat' for nil:NilClass

SELECT * FROM `sampling_sites` WHERE (`sampling_sites`.`id` = 2)
SELECT * FROM `water_uses` WHERE (`water_uses`.`id` = 1)
SELECT * FROM `water_types` WHERE (`water_types`.`id` = 1)
SELECT * FROM `land_use_mappings` WHERE (`land_use_mappings`.`id` = 1)
SELECT * FROM `geos` WHERE (`geos`.`id` = 2)
SELECT * FROM `altitude_types` WHERE (`altitude_types`.`id` = 1)
SELECT * FROM `catchment_areas` WHERE (`catchment_areas`.`id` = 1)
SELECT * FROM `geologies` WHERE (`geologies`.`id` = 1)
SELECT * FROM `depths` WHERE (`depths`.`id` = 1)
SELECT * FROM `size_typologies` WHERE (`size_typologies`.`id` = 1)
---
  def show
    @sampling_site = SamplingSite.find(params[:id])
    if @sampling_site.nil?
        redirect_to :action => "index"
    end
    @title = "Sampling sites"
    @wu = WaterUse.find(@sampling_site.water_uses_id)
    @wt = WaterType.find(@sampling_site.water_types_id)
    @lum = LandUseMapping.find(@sampling_site.land_use_mappings_id)
    @geo = Geo.find(@sampling_site.geos_id)

    @at = AltitudeType.find(@sampling_site.altitude_types_id)
    @ca = CatchmentArea.find(@sampling_site.catchment_areas_id)
    @geol = Geology.find(@sampling_site.geologies_id)
    @depth = Depth.find(@sampling_site.depth_id)
    @st = SizeTypology.find(@sampling_site.size_typologies_id)

SELECT * FROM `sampling_sites` WHERE (`sampling_sites`.`id` = 2)
---
  def edit
    @sampling_site = SamplingSite.find(params[:id])

SELECT * FROM `samplings` WHERE (sampling_site_id = '9') LIMIT 1
---
  def destroy
    if !signed_in_and_master?
      flash[:notice] = "Sorry. Only technical manager can delete data. Please, contact Roberto SPURIO to do it."
      redirect_to sampling_sites_path
    else

        @title = "Sampling site"

        @ws = Sampling.find(:first, :conditions => [ "sampling_site_id = ?", params[:id]])