app/controllers/samplings_controller.rb

SELECT * FROM `partners` WHERE (`partners`.`id` = 3)
SELECT * FROM `sampling_sites` WHERE (`sampling_sites`.`id` = 9)
---
  def index
    @samplings = Sampling.all
    @title = "List of samplings"

    #samplings = Sampling.find(:all, :joins=> [:sampling_equipments, :partner, :sampling_site]) do
    samplings = Sampling.find(:all, :joins=> [:partner, :sampling_site]) do