app/controllers/size_typologies_controller.rb

SELECT * FROM `size_typologies`
---
  def index
    @size_typologies = SizeTypology.all

SELECT * FROM `sampling_sites` WHERE (size_typologies_id = '3') LIMIT 1
---
  def destroy
    if !signed_in_and_master?
      flash[:notice] = "Sorry. Only technical manager can delete data. Please, contact Roberto SPURIO to do it."
      redirect_to size_typologies_path
    else

        @ss = SamplingSite.find(:first, :conditions => [ "size_typologies_id = ?", params[:id]])