app/controllers/users_controller.rb

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 3)

  def update
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 3)