app/controllers/water_uses_controller.rb

  def destroy
    if !signed_in_and_master?
      flash[:notice] = "Sorry. Only technical manager can delete data. Please, contact Roberto SPURIO to do it."
      redirect_to water_uses_path
    else

        @title = "water use"

        @ss = SamplingSite.find(:first, :conditions => [ "water_uses_id = ?", params[:id]])
        if !@ss.nil?
          flash[:error] = "This entry cannot be deleted until used by another entries in the system..."
          redirect_to :action => "index"
          return
        end

        @water_use = WaterUse.find(params[:id])
        @water_use.destroy
---
SELECT * FROM `sampling_sites` WHERE (water_uses_id = '3') LIMIT 1
DELETE FROM `water_uses` WHERE `id` = 3