app/controllers/water_types_controller.rb

  def index
    @water_types = WaterType.all
---
SELECT * FROM `water_types`

  def show
    @water_type = WaterType.find(params[:id])
---
SELECT * FROM `water_types` WHERE (`water_types`.`id` = 1)

  def edit
    @water_type = WaterType.find(params[:id])
---
SELECT * FROM `water_types` WHERE (`water_types`.`id` = 1)

  def destroy
    if !signed_in_and_master?
      flash[:notice] = "Sorry. Only technical manager can delete data. Please, contact Roberto SPURIO to do it."
      redirect_to water_types_path
    else

        @title = "water type"

        @ss = SamplingSite.find(:first, :conditions => [ "water_types_id = ?", params[:id]])
        if !@ss.nil?
          flash[:error] = "This entry cannot be deleted until used by another entries in the system..."
          redirect_to :action => "index"
          return
        end

        @water_type = WaterType.find(params[:id])
        @water_type.destroy
---
SELECT * FROM `sampling_sites` WHERE (water_types_id = '2') LIMIT 1
SELECT * FROM `water_types` WHERE (`water_types`.`id` = 3)
DELETE FROM `water_types` WHERE `id` = 3