app/controllers/wfilters_controller.rb

SELECT * FROM `wfilters`
---
  def index
    @wfilters = Wfilter.all

SELECT * FROM `wfilters` WHERE (`wfilters`.`id` = 2)
---
  def show
    @wfilter = Wfilter.find(params[:id])

SELECT * FROM `wfilters` WHERE (`wfilters`.`id` = 2)
---
  def edit
    @wfilter = Wfilter.find(params[:id])

INSERT INTO `wfilters` (`name`, `pore_size`, `created_at`, `updated_at`, `num_filters`, `note`) VALUES('', 0.0, '2011-11-22 16:15:33', '2011-11-22 16:15:33', 0, '')
---
  def create
    @wfilter = Wfilter.new(params[:wfilter])
    @title = "filter"

    respond_to do |format|
      if @wfilter.save

SELECT * FROM `wfilters` WHERE (`wfilters`.`id` = 2)
---
  def update
    @wfilter = Wfilter.find(params[:id])

SELECT * FROM `filter_samples` WHERE (wfilter_id = '6') LIMIT 1
SELECT * FROM `wfilters` WHERE (`wfilters`.`id` = 13)
DELETE FROM `wfilters` WHERE `id` = 13
---
  def destroy
    if !signed_in_and_master?
      flash[:notice] = "Sorry. Only technical manager can delete data. Please, contact Roberto SPURIO to do it."
      redirect_to altitude_types_path
    else

        @title = "filter"

        @filter_sample = FilterSample.find(:first, :conditions => [ "wfilter_id = ?", params[:id]])
        if !@filter_sample.nil?
          flash[:error] = "This entry cannot be deleted until used by another entries (Filter sample) in the system..."
          redirect_to :action => "index"
          return
        end

        @wfilter = Wfilter.find(params[:id])
        @wfilter.destroy